[{"title":"Major (Honours Program)","desc":["Students may enter this major in Semester 1 or any semester thereafter. A student wishing to declare the major may wish to consult the Faculty Advisor. A minimum total of 20.00 credits required to complete the major.","Students lacking Grade 12 or 4U Biology, Chemistry or Physics should follow the revised schedule of study for this major found at https://www.uoguelph.ca/bsc/revised_SS"],"table":[{"courses":["BIOL*1070","CHEM*1040","MATH*1080","PHYS*1080","BIOL*1080","BIOL*1090","CHEM*1050","PHYS*1070","BIOC*2580","MBG*2040","MICR*2420","ZOO*2090","BIOL*2060","BIOL*2400","STAT*2230","ZOO*2700","BOT*3710","ENVS*3090","IBIO*3100","IBIO*4100"],"credits":9.5}],"lists":[],"footnotes":[["Study Abroad can include an exchange, international letter of permission, study abroad or field school. Full details on the institutions and experiences available, along with application deadlines and admission requirements can be found on the University of Guelph, Centre for International Programs website: https://www.uoguelph.ca/cip/ "]]},{"title":"Restricted Electives","desc":["The major in Biodiversity is a flexible program that allows students, in consultation with faculty advisors, to pursue their own interests and design a customized program of study. For example, students may wish to select their electives to focus on a particular taxonomic group such as microbes, plants, invertebrates, or vertebrates, and/or one of the three areas of research strength in the Department of Integrative Biology: physiology, ecology, or evolution."],"table":[{"courses":["1. At least 1.00 credits of Liberal Education electives are required. 2","2. Select a minimum of 0.50 credits from the following:","BOT*2100","BOT*3050","ZOO*3600","3. Select a minimum of 0.50 credits from the following:","BOT*3310","BOT*3410","ZOO*3050","4. Select a minimum of 0.50 credits from the following: 3","BIOL*4410","BIOL*4610","BIOL*4700","BIOL*4710","BIOL*4800","BIOL*4810","IBIO*4500","IBIO*4510","IBIO*4521","IBIO*4522","ZOO*4170","ZOO*4300","Other field or research courses with approval of faculty advisor."],"credits":0}],"lists":[],"footnotes":[["The list of Liberal Education electives for B.Sc. students can be found at: https://www.uoguelph.ca/bsc","Biodiversity students are strongly encouraged to take at least one field course. Students should keep in mind that some of these courses have prerequisites that are not required courses for the BIOD major and should plan their programs accordingly."]]},{"title":"Credit Summary","desc":["(20.00 Total Credits)","*Of the total credits required, students are required to complete 16.00 credits in science of which a minimum of 2.00 credits must be at the 4000 level and an additional 4.00 credits must be at the 3000 or 4000 level."],"table":[{"courses":["First year science credits","Required science courses semesters 3 - 8","Restricted elective (# 2, 3 and 4 in restricted elective list)","Approved Science electives","Liberal Education (#1 in restricted electives)","Free electives - any approved elective for B.Sc. students","Total Credits"],"credits":0}],"lists":[],"footnotes":[]}]