[{"title":"Major (Honours Program)","desc":["A minimum of 10.00 credits is required, including:","7.50 core course requirements\n2.50 credits in one of five areas of emphasis"],"table":[],"lists":[],"footnotes":[]},{"title":"Core Requirements (7.50 credits)","desc":[],"table":[{"courses":["JLS*1000","PHIL*3040","POLS*2300","POLS*2350","POLS*3130","POLS*3650","POLS*3350","ANTH*1150 or SOC*1100","POLS*2650 or SOAN*2120","POLS*3140 or POLS*3210","Select 0.50 credits from the following:","PHIL*2120","PSYC*3020","SOC*3490","Select 1.00 credits from the following:","JLS*4000","JLS*4800& JLS*4900","Select 1.00 credits from the following:","JLS*4800","JLS*4900","POLS*4020","POLS*4040","POLS*4050","POLS*4060","POLS*4070","POLS*4100","POLS*4310","POLS*4740","POLS*4780"],"credits":0}],"lists":[],"footnotes":[["Cannot be taken as a restricted elective if taken to fulfill core requirements"]]},{"title":"Areas of Emphasis (2.50 credits)","desc":["Choose one of five Areas of Emphasis:"],"table":[],"lists":["\n\tCanadian Politics and Governance\n\tGlobal Relations and Governance\n\tGender and Sexuality\n\tArts and Humanities\n\tBusiness and Management\n"],"footnotes":[]},{"title":"Canadian Politics and Governance (Area of Emphasis)","desc":["The Canadian Politics and Governance Area of Emphasis will provide students with a broader understanding of the Canadian political context, including the political institutions and actors, in which legal institutions and processes operate. Students will examine Canadian political and social contexts to help them better identify and understand issues of justice in Canada and assess how these contexts shape and are shaped by law and legal processes. Students will have the opportunity to apply concepts and knowledge gained in the core of the JLS program to a variety of issues and problems in the Canadian context. "],"table":[{"courses":["POLS*2230 or POLS*2250","Select 0.50 credits from the following:","ANTH*2660","HIST*2100","HIST*2600","POLS*3340","Select 1.50 credits from the following:","HIST*3160","HIST*3180","POLS*3050","POLS*3140","POLS*3210","POLS*3250","POLS*3270","POLS*3370","POLS*3470"],"credits":0}],"lists":[],"footnotes":[["Note: If this course is taken in the core it cannot count as fulfilling this requirement in the Area of Emphasis."]]},{"title":"Global Relations and Governance (Area of Emphasis)","desc":["The Global Relations and Governance Area of Emphasis will provide students with a broader understanding of the global context in which legal institutions and processes operate. Students will examine international political and cultural contexts to help them better identify and understand issues of global justice and assess how these contexts shape and are shaped by law and legal processes. Students will have the opportunity to apply concepts and knowledge gained in the Core of the JLS program to a variety of issues and problems in the global context. "],"table":[{"courses":["IDEV*2400","POLS*3020","Select 0.50 credits from the following:","ANTH*2230","IDEV*2000","POLS*2100","POLS*2200","Select 1.00 credits from the following:","HIST*3070","HIST*3080","HIST*3150","HIST*3270","HIST*3320","HIST*3360","HIST*3460","HIST*3830","POLS*3000","POLS*3060","POLS*3080","POLS*3160","POLS*3320","POLS*3410","POLS*3450","POLS*3490","POLS*3670","POLS*3790","SOAN*3250"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Gender and Sexuality (Area of Emphasis)","desc":["The Gender and Sexuality Area of Emphasis will provide students with a broader understanding of gender and sexuality.  Students will explore different perspectives on gender and sexuality to help them better identify and understand issues of justice related to gender and sexuality and assess how conceptions of gender and sexuality shape and are shaped by law and legal processes.  Students will have the opportunity to apply concepts and knowledge gained in the Core of the JLS program to a variety of issues and problems related to gender and sexuality. "],"table":[{"courses":["POLS*3710","Select 1.00 credits from the following:","HIST*2930","PHIL*2060","POLS*2150","SOAN*2400","Select 1.00 credits from the following:","GEOG*3090","HIST*3020","HIST*3570","HIST*3580","POLS*3160","PSYC*3300","SOAN*3100","SOAN*3240"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Arts and Humanities (Area of Emphasis)","desc":["The Arts and Humanities Area of Emphasis will provide students with a broader understanding of the human experience developed in art, philosophy, and history. Students will examine different perspectives on the human condition informed by disciplines in the humanities to better identify and understand issues of justice and assess how conceptions of the human experience shape and are shaped by law and legal processes. Students will have the opportunity to apply concepts and knowledge gained in the Core of the JLS program to a variety of issues and problems in the arts and humanities. "],"table":[{"courses":["ENGL*2260","PHIL*3230","Select 0.50 credits from the following:","ENGL*2290","HUMN*2020","PHIL*1010","PHIL*1050","PHIL*2120","PHIL*2280","","EURO*3300","EURO*4050","HIST*3270","HUMN*3470","PHIL*3190","PHIL*3290","PHIL*3300"],"credits":0}],"lists":[],"footnotes":[["Note: If this course is taken in the core it cannot count as fulfilling this requirement in the Area of Emphasis."]]},{"title":"Business and Management (Area of Emphasis)","desc":["The Business and Management Area of Emphasis will provide students with a broader understanding of the business and management context in which legal institutions and processes operate.  Students will examine business and management issues to help them better identify and understand issues of justice and assess how these issues shape and are shaped by law and legal processes.  the opportunity to investigate how law and legal processes relate to business and management practices. Students will have the opportunity to apply concepts and knowledge gained in the Core of the JLS program to a variety of issues and problems in business and management. "],"table":[{"courses":["MCS*3040","MGMT*2150","MGMT*3020","HROB*2010 or HROB*2090","Select 0.50 credits from the following:","HROB*2010","HROB*2090","HROB*2200","HROB*2290","PHIL*2600","PHIL*3370","POLS*3470"],"credits":0}],"lists":[],"footnotes":[["Note: If this course is taken as one of the courses from the preceding list it cannot count as fulfilling this requirement in the Area of Emphasis."]]}]