[{"title":"Major","desc":["A minimum of 20.00 credits is required, including:"],"table":[{"courses":["CHEM*1040","HTM*2700 or NUTR*1010","PSYC*1000","CHEM*1050","FRHD*1020 or SOC*1100","HTM*2700 or NUTR*1010","NUTR*1020","BIOC*2580","HTM*2030","NUTR*2050","STAT*2080","BIOM*3200","HROB*2090","MICR*2420","STAT*2090","FRHD*3070","NUTR*3210","FRHD*3400","HROB*2290","NUTR*3070","NUTR*3090","NUTR*4010","NUTR*4070","NUTR*4900"],"credits":7}],"lists":[],"footnotes":[["HTM*2700 Understanding Foods is recommended for Semester 1 if capacity allows, but may also be taken in Semester 2 by choosing NUTR*1010 Introduction to Nutrition in Semester 1 ","HTM*2030 Control Systems in the Hospitality  Industry is recommended to be taken in Semester 3 if capacity allows, however it may be taken in Semester 4. If taken in Semester 4 take  HROB*2090 Individuals and Groups in Organizations in Semester 3.  ","Students completing an Area of Emphasis in Dietetics must take HTM*3090 Restaurant Operations Management. HTM*3090 Restaurant Operations Management is recommended in Semester 5 in place of elective or restricted elective if capacity allows, but it may also be taken in Semester 6. If taken in Semester 6 take FRHD*3400 Communication and Counselling Skills and HROB*2290 Human Resources Management in Semester 5.","Students completing an Area of Emphasis in Dietetics must take NUTR*4040 Clinical Nutrition II.","With approval from the instructor, students may substitute NUTR*4810 Applied Human Nutrition Thesis I and NUTR*4910 Applied Human Nutrition Thesis II for NUTR*4900 Selected Topics in Human Nutrition."]]},{"title":"Area of Emphasis in Dietetics","desc":["The area of emphasis requires the successful completion of 3.00 credits: 1.50 required credits and 1.50 credits selected from the list of restricted electives. At minimum, one of the courses from the restricted electives must be taken at the 3000-level. Note: Some restricted electives require prerequisite courses which are not included in the major. Students should consult the most recent calendar descriptions, planning carefully and seeking advice from the program counselling office."],"table":[{"courses":["Required Courses","HTM*3090","NUTR*4040","Restricted Electives","Select 1.50 restricted electives, including one 3000 level course, from the following:","FOOD*2010","FOOD*2400 or FOOD*3030 or FOOD*3050","FOOD*2410 or FOOD*3160","FOOD*2420 or FOOD*3230 or FOOD*3240","FOOD*3430","FOOD*3700","HTM*2740","HTM*3780","NUTR*3110","NUTR*3150"],"credits":0}],"lists":[],"footnotes":[]}]