[{"title":"Major (Honours Program)","desc":["The Biological Science major offers the opportunity to study a wide range of topics within biological science. The major is one of the most flexible within the B.Sc. program. After the core sciences in first and second year, students can tailor the degree to create a major all their own. With the wide breadth of courses offered, students can choose to focus their studies in one area of biological science or create a unique skill set and combination of courses not currently offered in any one of our majors. Students can also add a minor in either an area of science, arts or social science.","With this flexibility, students in the Biological Science major are encouraged to seek out study abroad opportunities through the Centre for International Programs. With a high number of elective spaces within the major, students can incorporate a study abroad and still meet the degree requirements within four years. Students who wish to pursue this option should start researching and planning in semesters 3 and 4.","Students may enter this major in Semester 1 or any semester thereafter. A student wishing to declare the major may wish to consult the Faculty Advisor. This major will require the completion of 20.00 credits as indicated below:"],"table":[],"lists":[],"footnotes":[]},{"title":"Schedule of Studies","desc":["Students lacking Grade 12 or 4U Biology, Chemistry or Physics should follow the revised schedule of study for this major found at https://www.uoguelph.ca/bsc/revised_SS"],"table":[{"courses":["BIOL*1090","CHEM*1040","MATH*1080","PHYS*1080","BIOL*1070","BIOL*1080","CHEM*1050","PHYS*1070","BIOL*2400","BIOC*2580 or MBG*2040","STAT*2040","BIOC*2580 or MBG*2040","Students are encouraged to consider study abroad options 1","Students are encouraged to consider study abroad options 1"],"credits":11.5}],"lists":[],"footnotes":[["Students interested in studying abroad need to apply in the year prior to going abroad. Students need to contact the Centre for International Programs to confirm admission requirements and to submit an application. Study abroad requires approval from the appropriate individuals and is pending available space at the host institution."]]},{"title":"Restricted Electives","desc":[],"table":[{"courses":["1. Select at least 2.00 credits of Liberal Education electives 2","2. Select a minimum of 0.50 credits in Ecology from the following:","BIOL*2060","BOT*3050","3. Select a minimum of 0.50 credits in Mathematical or Computational Science from the following:","CIS*1050","CIS*1200","CIS*1500","MATH*1090","STAT*2050","4. Select a minimum of 0.50 credits in Physiology from the following:","BIOM*3200","BOT*2100","HK*2810","ZOO*3600","5. 5.50 additional Biological Science credits of which 4.00 must be at the 3000 or 4000 level 4"],"credits":0}],"lists":[],"footnotes":[["The list of Liberal Education electives for B.Sc. students can be found at: https://www.uoguelph.ca/bsc/","May require additional prerequisites.","The list of approved science electives is posted at: https://bsc.uoguelph.ca/Approved_electives"]]},{"title":"Credit Summary","desc":["(20.00 Total Credits)"],"table":[{"courses":["First year science core","Required science courses semesters 3 - 8 (# 2, 3 and 4 in restricted elective list)","Approved Biological Science electives of which 4.00 must be 3000/4000 level (# 5 in restricted elective list)","Approved Science electives of which 2.00 credits must be 3000/4000 level 5,6","Liberal Education electives","Electives","Total Credits"],"credits":0}],"lists":[],"footnotes":[["May include 1 of BIOL*1020 Introduction to Biology, CHEM*1060 Introductory Chemistry","Of the total credits required, students are required to complete 16.00 credits in science of which a minimum of 2.00 credits must be at the 4000 level and an additional 4.00 credits must be at the 3000 or 4000 level."]]}]