[{"title":"Major (Honours Program)","desc":["B.Sc. students who were not admitted directly into the Human Kinetics major from high school and subsequently wish to transfer to the specialization must apply directly to the Department of Human Health and Nutritional Science by the last day of classes in the winter semester.","To be eligible after first year, applicants must have successfully completed 4.0 science credits in a B.Sc. specialization with an average of 70% or better in BIOL*1070 Discovering Biodiversity, BIOL*1080 Biological Concepts of Health and BIOL*1090 Introduction to Molecular and Cellular  Biology. For students with a 65-69.9% average in these three courses, admission to the major will be competitive based on available spaces.","Students wishing to transfer after second year or third year must have an average of 70% or better in their last two semesters (total of best 4.00 science credits). For students with a 65-69.9%, admission to the major will be competitive based on available spaces.","All decisions regarding transfers will be made by the end of June.","To complete the major, a minimum of 20.00 credits are required.","Students lacking Grade 12 or 4U Biology, Chemistry or Physics should follow the revised schedule of study for this major found at https://www.uoguelph.ca/bsc/revised_SS"],"table":[{"courses":["BIOL*1080","CHEM*1040","MATH*1080","PHYS*1080","BIOL*1070","BIOL*1090","CHEM*1050","PHYS*1070","BIOC*2580","HK*2270","MBG*2040","STAT*2040","HK*2810","MCB*2050","NUTR*3210","HK*3600","HK*3810","NUTR*3360","HK*3401 or HK*3501","BIOC*3560","HK*3100","HK*4600","Select one of the following:","HK*3402","HK*3502","HK*4550","NUTR*4210"],"credits":6.25}],"lists":[],"footnotes":[["If registered in HK*3401 Human Anatomy: Dissection in semester 5","If registered in HK*3501 Human Anatomy: Prosection in semester 5"]]},{"title":"Restricted Electives","desc":["A minimum of 2.00 credits of Liberal Education electives is required. The list of Liberal Education electives for B.Sc. students can be found at: https://www.uoguelph.ca/bsc/","A minimum of 1.00 credits of restricted electives are required which must be selected from HK*4XXX, NUTR*4XXX (must be an approved B.Sc. Science Elective)."],"table":[],"lists":[],"footnotes":[]},{"title":"Credit Summary","desc":["(20.00 Total Credits)","Of the total credits required, students are required to complete 16.00 credits in science of which a minimum of 2.00 credits must be at the 4000 level and an additional 4.00 credits must be at the 3000 or 4000 level."],"table":[{"courses":["First year science core","Required science courses semesters 3 - 8","Restricted elective (# 2 in restricted elective list)","Approved Science Electives","Liberal Education Electives (#1 in restricted electives list)","Free Electives - any approved electives for B.Sc. students","Total Credits"],"credits":0}],"lists":[],"footnotes":[]}]