[{"title":"Major (Honours Program)","desc":["A minimum of 10.00 credits is required, including:"],"table":[{"courses":["Core Requirements ","IDEV*1000","IDEV*2000","IDEV*2100","IDEV*2200","IDEV*2300","IDEV*2400","IDEV*3000","IDEV*3100","IDEV*3300","IDEV*3400","IDEV*4000","IDEV*4600","Select 1.00 credits from the following:","GEOG*3050","PHIL*3230","POLS*3320","POLS*3790","SOAN*3680","Areas of Emphasis","Select one of the following four Area of Emphasis:","Agriculture and Food Security","Development in the Canadian Context","Development in Fragile Contexts","Environment and Sustainable Development","Gender and Inclusive Development"],"credits":0}],"lists":["\n\t7.50 core course requirements\n\t2.50 credits in one of four areas of emphasis\n"],"footnotes":[]},{"title":"Agriculture and Food Security","desc":["This area of emphasis focuses on the nature of food security from the local to global levels. It explores the role of agriculture and the wider agri-food system in promoting food security towards the eradication of hunger and improved nutrition and health. Throughout, this area of emphasis reflects critically on the role of diverse actors and alternative approaches through which food security can be enhanced, empowering students to bring about positive, inclusive and sustainable change in agri-food systems locally and globally."],"table":[{"courses":["AGR*2150","FARE*1300","Select 1.50 credits from the following:","AGR*2500","ANTH*4550","ENVS*2130","FARE*3250","GEOG*3320","HIST*3240","IDEV*4100","IDEV*4150","OAGR*2070","SOC*4420"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Development in the Canadian Context","desc":["This area focuses on development predominantly through the case of Canada. Issues that might be explored include: poverty, global migration, inequality, Indigenous-settler relations and food insecurity. It reflects the fact that development problems are found in all parts of the world and solutions to them must recognize the ways in which they are interconnected and distinctive. This area of emphasis aims to empower students to bring about positive, inclusive and sustainable change within Canada, and the rest of the affluent world."],"table":[{"courses":["ANTH*2660","POLS*2300","Select 1.50 credits from the following:","GEOG*2510","HIST*2090","HIST*3390","HIST*3660","IDEV*4100","IDEV*4150","POLS*3140","SOAN*4210","SOAN*4220","SOAN*4260"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Development in Fragile Contexts","desc":["This area focuses on development in the context of institutionally weak and/or unstable countries and regions. It explores issues associated with state fragility and failure, institutional development, post-conflict rebuilding and social insecurity. It also considers issues of migration, conflict, social change, and post colonialism. An overarching theme is the need for, and role of, distinct development strategies in fragile contexts, with the aim of empowering students to bring about positive, inclusive and sustainable change in some of the most challenging development contexts globally."],"table":[{"courses":["POLS*3490","POLS*2100 or POLS*2200","Select 1.50 credits from the following:","ANTH*4440","HIST*3270","IDEV*4100","IDEV*4150","POLS*3000","POLS*3060","POLS*3080","POLS*4340","SOAN*3130","SOAN*4260"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Environment and Sustainable Development","desc":["This area of emphasis focuses on the relations between environmental change and natural resources and sustainable development. It explores the ways in which the environment and natural resources impact development, and the development challenges posed by environmental change and natural resource use locally and globally. Topics might include urbanization, erosion, natural disasters, water, natural resource, land use and climate change. Particular focus is put on approaches to development that are sustainable and address challenges associated with environmental change and natural resource use. This area of emphasis aims to empower students to bring about positive change that promotes inclusive and sustainable development locally and globally."],"table":[{"courses":["GEOG*2030","SOC*2280","Select 1.50 credits from the following:","ENVS*2120","GEOG*3020","GEOG*3030","GEOG*3090","HIST*3460","IDEV*4100","IDEV*4150","PHIL*2070","POLS*3370","SOAN*4250"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Gender and Inclusive Development","desc":["This area of emphasis focuses on the need for development to be viewed through the lens of inclusivity, most notably with respect to gender.  It explores the ways in which development often acts to exclude or negatively impact women and other marginalized groups, and the need for development policies and programs to be designed and implemented in a manner that promotes inclusivity with respect to gender. The notion of gender-inclusive development is examined through the perspective of intersectionality. Whilst particular attention is given to gender, there is also examination of sexuality, race, indigeneity and other dimensions of marginalization."],"table":[{"courses":["POLS*3160","SOAN*3240","Select 1.50 credits from the following:","ANTH*4440","GEOG*3090","HIST*2930","IDEV*4100","IDEV*4150","PHIL*2060","POLS*2150","SOAN*4220","SOAN*4230","WMST*2000"],"credits":0}],"lists":[],"footnotes":[]},{"title":"Area of Concentration (General Program)","desc":["A minimum of 5.00 credits is required, including:"],"table":[{"courses":["IDEV*1000","IDEV*2000","IDEV*2200","IDEV*2300","IDEV*2400","Select 1.00 credits from the following:","IDEV*2100","IDEV*3000","IDEV*3100","IDEV*3400","IDEV*4600","Select 0.50 credits from the following:","GEOG*3050","PHIL*3230","POLS*3320","POLS*3790","SOAN*3680","Select a minimum of 1.00 credits taken from any of the four areas of emphasis of the Major, at least 0.50 being at the 3000 or 4000 levels."],"credits":0}],"lists":[],"footnotes":[]},{"title":"Minor (Honours Program)","desc":["A minimum of 5.00 credits is required, including:"],"table":[{"courses":["IDEV*1000","IDEV*2000","IDEV*2200","IDEV*2300","IDEV*2400","Select 1.00 credits from the following:","IDEV*2100","IDEV*3000","IDEV*3100","IDEV*3400","IDEV*4600","Select 0.50 credits from the following:","GEOG*3050","PHIL*3230","POLS*3320","POLS*3790","SOAN*3680","Select a minimum of 1.00 credits taken from any of the four areas of emphasis of the Major, at least 0.50 being at the 3000 or 4000 levels."],"credits":0}],"lists":[],"footnotes":[]}]