[{"title":"Major (Honours Program)","desc":["Knowledge of Mathematics and Statistics is crucial for understanding our world. This unique program provides a core of both mathematics and statistics with a choice of a Mathematics stream or a Statistics stream. This major also requires the completion of an area of emphasis as listed. Students are encouraged to speak with a Program Counsellor when choosing courses for the selected stream and area of emphasis.","Students may enter this major in Semester 1 or any semester thereafter. A student wishing to declare the major must consult the Faculty Advisor. A total of 20.00 credits is required to complete the Major which includes at least 10.00 credits in Mathematics & Statistics, 0.50 credits in Computing and Information Science, and an additional 2.50 credits in an area of emphasis. Of the total credits required, students are required to complete 2.00 Mathematics and/or Statistics credits at the 4000 level and an additional 3.00 Mathematics and/or Statistics credits must be at the 3000 or 4000 level.","Students are required to complete 5.50 credits from either the Mathematics Stream or the Statistics Stream as follows:"],"table":[{"courses":["MATH*1160","MATH*1200","MATH*1210","STAT*2040","CIS*1300 or CIS*1500","MATH*2200","STAT*3100","MATH*2130","STAT*2050","MATH*4440"],"credits":15}],"lists":[],"footnotes":[["MATH*1080 Elements of Calculus I or IPS*1500 Integrated Mathematics and Physics I can be taken in place of MATH*1200 Calculus I","These courses should be chosen from the list of Semester 1 requirements as listed in the Program Regulations for the BA.","MATH*1090 Elements of Calculus II or IPS*1510 Integrated Mathematics and Physics II can be taken in place of MATH*1210 Calculus II","Students are reminded that they must meet the BA distribution requirements of 1.50 credits in the humanities and 1.50 credits in the social sciences. PHIL*2110 Formal Logic is recommended.","CIS*2500 Intermediate Programming is recommended"]]},{"title":"Mathematics Stream","desc":[],"table":[{"courses":["MATH*2000","MATH*2210","MATH*2270","MATH*3160","MATH*3200"],"credits":3}],"lists":[],"footnotes":[]},{"title":"Statistics Stream","desc":[],"table":[{"courses":["STAT*3110","STAT*3240"],"credits":4.5}],"lists":[],"footnotes":[]},{"title":"Areas of Emphasis","desc":["Students are required to complete 2.50 credits from one of the following Areas of Emphasis:","Each Area of Emphasis is 2.50 credits from a single field of study."],"table":[],"lists":[],"footnotes":[]},{"title":"Computer Science (CS)*","desc":["The following credits must be taken:"],"table":[{"courses":["CIS*2430","CIS*2500","CIS*2520","Select at least 1.00 credits from the following:","CIS*3110","CIS*3190","CIS*3490","CIS*3530"],"credits":0}],"lists":[],"footnotes":[["Students are reminded that they must meet the BA requirement that at least 7.00 credits must be at the 3000 level of above."]]},{"title":"Economics (ECON)*","desc":["The following credits must be taken:"],"table":[{"courses":["ECON*1050","ECON*1100","ECON*2310","Select at least 1.00 credits from the following:","ECON*3100","ECON*3710","ECON*4710"],"credits":0}],"lists":[],"footnotes":[["Students are reminded that they must meet the BA requirement that at least 7.00 credits must be at the 3000 level of above."]]},{"title":"Individualized (IND)*","desc":["It is required that 2.50 credits are taken from humanities and social science electives where 1.00 credits must be at the 3000 level or above.","Students declaring an Individualized Area of Emphasis must have their choice of 2.50 credits approved by an academic advisor."],"table":[],"lists":[],"footnotes":[["Students are reminded that they must meet the BA requirement that at least 7.00 credits must be at the 3000 level of above."]]}]